import pytest
import datetime

@pytest.fixture
def get_str_date():
    return '2019-07-17 15:05:27'

@pytest.fixture
def result_str_date():
    return datetime.datetime(2019, 7, 1, 0, 0)

@pytest.fixture
def get_data_dict():
    return [{'Дата операции': '17.07.2019 15:04:27'},
            {'Дата операции': '17.07.2019 15:04:27'},
            {'Дата операции': '17.08.2019 15:04:27'},
            {'Дата операции': '17.08.2019 15:04:27'}]

@pytest.fixture
def result_data_dict():
    return [{'Дата операции': '17.07.2019 15:04:27'},
            {'Дата операции': '17.07.2019 15:04:27'}]

@pytest.fixture
def get_list_dict_by_card_trans():
    return [{'Номер карты': '*1111', 'Сумма операции': -25.0},
            {'Номер карты': '*2222', 'Сумма операции': 25.0},
            {'Номер карты': '*2222', 'Сумма операции': -25.0},
            {'Номер карты': '*3333', 'Сумма операции': -25.0},
            {'Номер карты': '*3333', 'Сумма операции': -25.0},
            {'Номер карты': '*3333', 'Сумма операции': -25.0},
            {'Номер карты': '*0000', 'Сумма операции': 0.0}]

@pytest.fixture
def result_list_dict_by_card_trans():
    return [{'Номер карты': '*0000', 'расходы по карте': 0.0, 'cashback':0.0},
            {'Номер карты': '*1111', 'расходы по карте': -25.0, 'cashback':0.25},
            {'Номер карты': '*2222', 'расходы по карте': -25.0, 'cashback':0.25},
            {'Номер карты': '*3333', 'расходы по карте': -75.0, 'cashback':0.75}
            ]


@pytest.fixture
def get_list_dict_by_top_five_trans():
    return [{'Категория': 'Переводы', 'Описание': 'На р/с ООО "ФОРТУНА"', 'Дата операции': '15.07.2019 20:00:31', 'Сумма операции': -50000.0},
            {'Категория': 'nan', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 17:44:36', 'Сумма операции': -17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 18:14:20', 'Сумма операции': 17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '06.07.2019 21:08:09', 'Сумма операции': 13000.0},
            {'Категория': 'Наличные', 'Описание': 'Снятие в банкомате Альфа-Банк', 'Дата операции': '06.07.2019 14:08:29',
             'Сумма операции': -3000.0},
            {'Категория': 'Переводы', 'Описание': 'На р/с ООО "ФОРТУНА"', 'Дата операции': '15.07.2019 20:00:31',
             'Сумма операции': -1000.0},
            {'Категория': 'nan', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 17:44:36', 'amount': -500.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 18:14:20',
             'Сумма операции': 0.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '06.07.2019 21:08:09',
             'Сумма операции': 1300.0},
            {'Категория': 'Наличные', 'Описание': 'Снятие в банкомате Альфа-Банк', 'Дата операции': '06.07.2019 14:08:29',
             'Сумма операции': -30.0}

            ]

@pytest.fixture
def result_list_dict_by_top_five_trans():
    return [{'Категория': 'Переводы', 'Описание': 'На р/с ООО "ФОРТУНА"', 'Дата операции': '15.07.2019 20:00:31', 'Сумма операции': -50000.0},
            {'Категория': 'nan', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 17:44:36', 'Сумма операции': -17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 18:14:20', 'Сумма операции': 17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '06.07.2019 21:08:09', 'Сумма операции': 13000.0},
            {'Категория': 'Наличные', 'Описание': 'Снятие в банкомате Альфа-Банк', 'Дата операции': '06.07.2019 14:08:29',
             'Сумма операции': -3000.0}
            ]




