import pytest
import datetime
import pandas as pd

@pytest.fixture
def get_str_date():
    return '2019-07-17 15:05:27'

@pytest.fixture
def result_str_date():
    return datetime.datetime(2019, 7, 1, 0, 0)

@pytest.fixture
def get_data_dict():
    return [{'Дата операции': '17.07.2019 15:04:27'},
            {'Дата операции': '17.07.2019 15:04:27'},
            {'Дата операции': '17.08.2019 15:04:27'},
            {'Дата операции': '17.08.2019 15:04:27'}]

@pytest.fixture
def result_data_dict():
    return [{'Дата операции': '17.07.2019 15:04:27'},
            {'Дата операции': '17.07.2019 15:04:27'}]

@pytest.fixture
def get_list_dict_by_card_trans():
    return [{'Номер карты': '*1111', 'Сумма операции': -25.0},
            {'Номер карты': '*2222', 'Сумма операции': 25.0},
            {'Номер карты': '*2222', 'Сумма операции': -25.0},
            {'Номер карты': '*3333', 'Сумма операции': -25.0},
            {'Номер карты': '*3333', 'Сумма операции': -25.0},
            {'Номер карты': '*3333', 'Сумма операции': -25.0},
            {'Номер карты': '*0000', 'Сумма операции': 0.0}]

@pytest.fixture
def result_list_dict_by_card_trans():
    return [{'Номер карты': '*0000', 'расходы по карте': 0.0, 'cashback':0.0},
            {'Номер карты': '*1111', 'расходы по карте': -25.0, 'cashback':0.25},
            {'Номер карты': '*2222', 'расходы по карте': -25.0, 'cashback':0.25},
            {'Номер карты': '*3333', 'расходы по карте': -75.0, 'cashback':0.75}
            ]


@pytest.fixture
def get_list_dict_by_top_five_trans():
    return [{'Категория': 'Переводы', 'Описание': 'На р/с ООО "ФОРТУНА"', 'Дата операции': '15.07.2019 20:00:31', 'Сумма операции': -50000.0},
            {'Категория': 'nan', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 17:44:36', 'Сумма операции': -17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 18:14:20', 'Сумма операции': 17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '06.07.2019 21:08:09', 'Сумма операции': 13000.0},
            {'Категория': 'Наличные', 'Описание': 'Снятие в банкомате Альфа-Банк', 'Дата операции': '06.07.2019 14:08:29',
             'Сумма операции': -3000.0},
            {'Категория': 'Переводы', 'Описание': 'На р/с ООО "ФОРТУНА"', 'Дата операции': '15.07.2019 20:00:31',
             'Сумма операции': -1000.0},
            {'Категория': 'nan', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 17:44:36', 'amount': -500.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 18:14:20',
             'Сумма операции': 0.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '06.07.2019 21:08:09',
             'Сумма операции': 1300.0},
            {'Категория': 'Наличные', 'Описание': 'Снятие в банкомате Альфа-Банк', 'Дата операции': '06.07.2019 14:08:29',
             'Сумма операции': -30.0}
            ]


@pytest.fixture
def get_list_dict_for_expensies():
    return [{'Категория': 'Переводы', 'Описание': 'На р/с ООО "ФОРТУНА"', 'Дата операции': '15.07.2019 20:00:31', 'Сумма платежа': -50000.0},
            {'Категория': 'nan', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 17:44:36', 'Сумма платежа': -17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 18:14:20', 'Сумма платежа': 17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '06.07.2019 21:08:09', 'Сумма платежа': 13000.0},
            ]

@pytest.fixture
def result_list_dict_only_expenses():
    return pd.DataFrame({'Категория':['Переводы', 'nan'], 'Описание': ['На р/с ООО "ФОРТУНА"', 'Перевод с карты'], 'Дата операции': ['15.07.2019 20:00:31','01.07.2019 17:44:36'],
                         'Сумма платежа': [-50000.0, -17000.0]})


@pytest.fixture
def result_list_dict_by_top_five_trans():
    return [{'Категория': 'Переводы', 'Описание': 'На р/с ООО "ФОРТУНА"', 'Дата операции': '15.07.2019 20:00:31', 'Сумма операции': -50000.0},
            {'Категория': 'nan', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 17:44:36', 'Сумма операции': -17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '01.07.2019 18:14:20', 'Сумма операции': 17000.0},
            {'Категория': 'Пополнения', 'Описание': 'Перевод с карты', 'Дата операции': '06.07.2019 21:08:09', 'Сумма операции': 13000.0},
            {'Категория': 'Наличные', 'Описание': 'Снятие в банкомате Альфа-Банк', 'Дата операции': '06.07.2019 14:08:29',
             'Сумма операции': -3000.0}
            ]

@pytest.fixture()
def get_df_trans():
    return pd.DataFrame({'Валюта операции': ['RUB', 'RUB', 'RUB', 'RUB', 'RUB', 'RUB'],
                         'Дата операции': ['30.12.2021 16:44:00', '29.12.2021 12:22:00',
                                           '28.12.2021 10:02:00', '30.12.2021 16:44:00',
                                           '29.12.2021 12:22:00', '28.12.2021 10:02:00'],
                          'Категория': ['Аптеки', 'Аптеки', 'Супермаркеты',
                                        'Супермаркеты', 'Пополнения', 'Дом и ремонт'],
                         'sum_by_column': [-3000.0, 200.0, -10000.0,
                                            -3000.0, 200.0, -10000.0]})

@pytest.fixture()
def result_df_sorted():
    return pd.DataFrame({'category': ['Супермаркеты', 'Дом и ремонт', 'Аптеки', 'Пополнения'],
                         'amount': [-13000.0, -10000.0, -2800.0, 200.0]})

@pytest.fixture()
def get_df_trans_for_filtr():
    return pd.DataFrame({'Валюта операции': ['RUB', 'RUB', 'RUB', 'RUB', 'RUB', 'RUB'],
                         'Дата операции': ['30.12.2021 16:44:00', '29.12.2021 12:22:00',
                                           '28.12.2021 10:02:00', '30.12.2021 16:44:00',
                                           '29.12.2021 12:22:00', '28.12.2021 10:02:00'],
                          'category': ['Аптеки', 'Аптеки', 'Супермаркеты',
                                        'Супермаркеты', 'Пополнения', 'Дом и ремонт'],
                         'sum_by_column': [-3000.0, 200.0, -10000.0,
                                            -3000.0, 200.0, -10000.0]})

@pytest.fixture()
def filtr_main_category():
    return pd.DataFrame({'index': [2,3,5], 'Валюта операции': ['RUB', 'RUB', 'RUB'],
                         'Дата операции': ['28.12.2021 10:02:00', '30.12.2021 16:44:00', '28.12.2021 10:02:00'],
                         'category': ['Супермаркеты', 'Супермаркеты', 'Дом и ремонт'],
                         'sum_by_column': [-10000.0, -3000.0, -10000.0]})

@pytest.fixture()
def get_top_seven_category_mai():
    return pd.DataFrame({'category': ['Супермаркеты', 'Дом и ремонт', 'Аптеки', 'Пополнения',
                                                             'Фатсфуд','Образование', 'Связь', 'Билеты',
                                                             'Семья', 'Дети','Родители', 'Питомцы'],
                         'amount': [-13000.0, -10000.0, -2800.0, 200.0,
                                    -13000.0, -10000.0, -2800.0, 200.0,
                                    -13000.0, -10000.0, -2800.0, 200.0]})

@pytest.fixture()
def result_top_seven_category_mai():
    return [{'category': 'Супермаркеты', 'amount': 13000.0}, {'category': 'Дом и ремонт', 'amount': 10000.0},
            {'category': 'Аптеки', 'amount': 2800.0}, {'category': 'Пополнения', 'amount': 200.0},
            {'category': 'Фатсфуд', 'amount': 13000.0}, {'category': 'Образование', 'amount': 10000.0},
            {'category': 'Связь', 'amount': 2800.0}, {'category': 'Остальное', 'amount': 25400.0}]

@pytest.fixture()
def result_income_category_main():
    return [{'category': 'Супермаркеты', 'amount': -13000.0}, {'category': 'Дом и ремонт', 'amount': -10000.0},
            {'category': 'Аптеки', 'amount': -2800.0}, {'category': 'Пополнения', 'amount': 200.0},
            {'category': 'Фатсфуд', 'amount': -13000.0}, {'category': 'Образование', 'amount': -10000.0},
            {'category': 'Связь', 'amount': -2800.0}, {'category': 'Билеты', 'amount': 200.0},
            {'category': 'Семья', 'amount': -13000.0}, {'category': 'Дети', 'amount': -10000.0},
            {'category': 'Родители', 'amount': -2800.0}, {'category': 'Питомцы', 'amount': 200.0}]


@pytest.fixture()
def get_extract_transfer_cash():
    return pd.DataFrame({'Валюта операции': ['RUB', 'RUB', 'RUB', 'RUB', 'RUB', 'RUB'],
                         'Дата операции': ['30.12.2021 16:44:00', '29.12.2021 12:22:00',
                                           '28.12.2021 10:02:00', '30.12.2021 16:44:00',
                                           '29.12.2021 12:22:00', '28.12.2021 10:02:00'],
                          'category': ['Аптеки', 'Аптеки', 'Супермаркеты',
                                        'Супермаркеты', 'Пополнения', 'Дом и ремонт'],
                         'amount': [3000.0, 200.0, 10000.0,
                                            3000.0, 200.0, 10000.0]})
@pytest.fixture()
def result_extract_transfer_cash():
    return [{'category': 'Аптеки', 'amount': 3000.0}, {'category': 'Аптеки', 'amount': 200.0}, {'category': 'Пополнения', 'amount': 200.0}]











